Machine Learning Project -
Step1 : Data Pre-Processing

In [47]:
#Importing numpy and pandas libraries for data manipulation
import numpy as np
from pandas import read_csv

In [48]:
#Location of the dataset
filepath = 'Dataset/sales.csv'

In [49]:
#Loading the data in a dataframe
df = read_csv(filepath)

In [50]:
# Display the first five rows of the dataset
df.head()

    rate  sales_in_first_month  sales_in_second_month  sales_in_third_month
0    NaN                     2                    500                   300
1    NaN                     4                    300                   650
2   four                   600                    200                   400
3   nine                   450                    320                   650
4  seven                   600                    250                   350

In [51]:
# Display the shape of the dataset
df.shape

(6, 4)

In [52]:
#Checking for null values in the dataset
df.isnull().sum()

rate                     2
sales_in_first_month     0
sales_in_second_month    0
sales_in_third_month     0
dtype: int64

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   rate                   4 non-null      object
 1   sales_in_first_month   6 non-null      int64
 2   sales_in_second_month  6 non-null      int64
 3   sales_in_third_month   6 non-null      int64
dtypes: int64(3), object(1)
memory usage: 324.0+ bytes

In [54]:
# mean of all numerical columns
df.mean(numeric_only=True)

sales_in_first_month     367.666667
sales_in_second_month    295.000000
sales_in_third_month     508.333333
dtype: float64

In [57]:
# Filling missing values with mean of respective columns
df['rate'].fillna(0, inplace=True)

In [56]:
df.head()

    rate  sales_in_first_month  sales_in_second_month  sales_in_third_month
0      0                     2                    500                   300
1      0                     4                    300                   650
2   four                   600                    200                   400
3   nine                   450                    320                   650
4  seven                   600                    250                   350

Step 2 - Feature selection

In [58]:
# Feature Selection
X = df.iloc[:, :3]
y = df.iloc[:, -1]

In [59]:
X.head()

    rate  sales_in_first_month  sales_in_second_month
0      0                     2                    500
1      0                     4                    300
2   four                   600                    200
3   nine                   450                    320
4  seven                   600                    250

In [60]:
y.head()

0    300
1    650
2    400
3    650
4    350
Name: sales_in_third_month, dtype: int64

Step 3 - Convert Words to Number

Step 4 - Concatenating X and y

Step 5 - Train Model and Check Accuracy

Step 6 - Dump and test a Model